In [1]:
import numpy as np
import pandas as pd
from scipy.stats import ttest_ind

In [7]:

file_path = r"C:\Users\Tetiana\Documents\ironhack\lab\lab-t-tests-p-values\files_for_lab\machine.txt"
df = pd.read_csv(file_path, encoding='utf-16', delimiter='\t')
df

   New machine      Old machine
0         42.1             42.7
1         41.0             43.6
2         41.3             43.8
3         41.8             43.3
4         42.4             42.5
5         42.8             43.5
6         43.2             43.1
7         42.3             41.7
8         41.8             44.0
9         42.7             44.1

H0 - machines work the same.
H1 - a new machine will pack faster on the average than the machine currently used.
It's one-tailed test, t-test. Level of significance 0.05.

In [9]:
df.describe()

       New machine      Old machine
count    10.000000        10.000000
mean     42.140000        43.230000
std       0.683455         0.749889
min      41.000000        41.700000
25%      41.800000        42.800000
50%      42.200000        43.400000
75%      42.625000        43.750000
max      43.200000        44.100000

In [15]:

df.rename(columns={'    Old machine': 'Old machine'}, inplace=True)

In [16]:
df.columns

Index(['New machine', 'Old machine'], dtype='object')

In [17]:
ttest_ind(df['New machine'],df['Old machine'])

TtestResult(statistic=-3.3972307061176026, pvalue=0.0032111425007745158, df=18.0)

Since the p-value (0.0032) is less than the significance level (0.05), we reject the null hypothesis (H0) at the 0.05 level of significance. This means that there is sufficient evidence to conclude that the new machine packs faster on average than the machine currently used.

In [20]:
df1=pd.read_csv(r"C:\Users\Tetiana\Documents\ironhack\lab\lab-t-tests-p-values\files_for_lab\student_gpa.txt", encoding='utf-8', delimiter='\t')
df1

    Sophomores    Juniors
0         3.04       2.56
1         1.71       2.77
2         3.30       2.70
3         2.88       3.00
4         2.11       2.98
5         2.60       3.47
6         2.92       3.26
7         3.60       3.20
8         2.28       3.19
9         2.82       2.65
10        3.03       3.00
11        3.13       3.39
12        2.86       2.58
13        3.49        NaN
14        3.11        NaN
15        2.13        NaN
16        3.27        NaN

In [21]:
df1.describe()

       Sophomores    Juniors
count   17.000000  13.000000
mean     2.840000   2.980769
std      0.519832   0.309259
min      1.710000   2.560000
25%      2.600000   2.700000
50%      2.920000   3.000000
75%      3.130000   3.200000
max      3.600000   3.470000

In [31]:
df1.columns

Index(['Sophomores', 'Juniors'], dtype='object')

In [30]:
df1.rename(columns={'  Juniors':'Juniors'}, inplace=True)

In [33]:
df1['Juniors'].fillna(df1['Juniors'].median(), inplace=True)

In [34]:
df1['Juniors']

0     2.56
1     2.77
2     2.70
3     3.00
4     2.98
5     3.47
6     3.26
7     3.20
8     3.19
9     2.65
10    3.00
11    3.39
12    2.58
13    3.00
14    3.00
15    3.00
16    3.00
Name: Juniors, dtype: float64

H0 - mean GPAs of sophomores and juniors at the university are the same
H1 - mean GPAs of sophomores and juniors at the university differ(lower, higher)
It's two-tailed test, t-test. Level of significance 0.05.

In [42]:
#Degrees of freedom
d_of_f=len(df1['Sophomores'])-1+len(df1['Juniors'])-1
d_of_f

32

In [44]:
df1.describe()

       Sophomores    Juniors
count   17.000000  17.000000
mean     2.840000   2.985294
std      0.519832   0.267958
min      1.710000   2.560000
25%      2.600000   2.770000
50%      2.920000   3.000000
75%      3.130000   3.190000
max      3.600000   3.470000

In [49]:
import math

x1 = df1['Sophomores'].mean()
x2 = df1['Juniors'].mean()
s1 = df1['Sophomores'].std()
s2 = df1['Juniors'].std()
n1 = len(df1['Sophomores'])
n2 = len(df1['Juniors'])

t = (x1 - x2 - 0) / math.sqrt((s1**2 / n1) + (s2**2 / n2))
t

-1.0243364646211426

For a significance level of 0.05 and 32 degrees of freedom, the critical values are approximately ±2.042.

Since the absolute value of the test statistic (1.0243364646211428) is less than the critical value (2.042), we fail to reject the null hypothesis. This means that the observed difference in mean GPAs between sophomores and juniors is not statistically significant at the 0.05 significance level.

In [43]:
ttest_ind(df1['Sophomores'], df1['Juniors'])

TtestResult(statistic=-1.0243364646211428, pvalue=0.3133579547829124, df=32.0)